Tekla Open API Reference for Tekla Structures 2025
GridLine.GridLabel.GridLabelPoint Property
 The grid line's label point. If the value of GridLabelPoint differs from the OffsetGridPoint value, a leader line will be created to the GridLabelPoint position. You can remove the leader line by setting GridLabelPoint to the GridPoint value (or by setting the GridLabelPoint anywhere on the grid line, but then the offset will change).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point GridLabelPoint { get; set; }
Public Property GridLabelPoint As Point
	Get
	Set
Property Value
Type: Point
See Also
Reference
GridLine.GridLabel Class
Tekla.Structures.Drawing Namespace